// Setting All Data

let units = [];

let lessons = {

};

let content = {
    
}

const excersices = {
    "التدوين و التلخيص":  [ 
        { 
            "Question" : "ما هو التلخيص والتدوين؟", 
            "answers" : ['حذف الأفكار الفرعية والاحتفاظ بالأفكار الأساسية', 'استخدام الجمل القصيرة المفهومة', 'استخدام الألوان لتمييز الأفكار الرئيسية'], 
            "correctAnswer" : 'حذف الأفكار الفرعية والاحتفاظ بالأفكار الأساسية',  
        }, 
        { 
            "Question" : "ما هي طرق التلخيص؟", 
            "answers" : ['استخدام الجمل القصيرة المفهومة', 'كتابة المحتوى بصياغتي', 'استخدام العناوين الرئيسية والفرعية والترقيم'], 
            "correctAnswer" : 'استخدام الجمل القصيرة المفهومة',  
        }, 
        { 
            "Question" : "ما هي فوائد التلخيص؟", 
            "answers" : ['توفير الوقت والجهد', 'تمييز العناوين الرئيسية والفرعية', 'تدريب الطلاب على تنظيم وترتيب الأفكار'], 
            "correctAnswer" : 'توفير الوقت والجهد',  
        } 
    ], 
    "مبادئ الثقافة الرقمية  (الجزء الأول)": [
        {
            "Question": "ما هو نوع الكمبيوتر الذي يتميز بحجمه الكبير وإمكانياته البسيطة؟",
            "answers": ["الحاسوب الشخصي", "الجهاز اللوحي", "السيرفر"],
            "correctAnswer": "السيرفر"
        },
        {
            "Question": "ما هو نوع الكمبيوتر الذي يتميز بخفة وزنه وإمكانياته المحدودة المدمجة؟",
            "answers": ["الحاسوب الشخصي", "السيرفر", "الجهاز اللوحي"],
            "correctAnswer": "الجهاز اللوحي"
        },
        {
            "Question": "ما هو نوع الكمبيوتر الذي يتميز بإمكانياته العالية ويعمل 24 ساعة؟",
            "answers": ["الحاسوب الشخصي", "الجهاز اللوحي", "السيرفر"],
            "correctAnswer": "السيرفر"
        },
        {
            "Question": "ما هو سطح المكتب؟",
            "answers": ["واجهة المستخدم الرسومية", "واجهة المستخدم النصية", "واجهة المستخدم الرئيسية للمستخدم"],
            "correctAnswer": "واجهة المستخدم الرئيسية للمستخدم"
        },
        {
            "Question": "ما هو تسجيل الدخول؟",
            "answers": ["عملية دخول المستخدم إلى الحساب", "عملية دخول المستخدم للجهاز", "عملية إنشاء حساب جديد"],
            "correctAnswer": "عملية دخول المستخدم للجهاز"
        },
        {
            "Question": "ما هي كلمة السر؟",
            "answers": ["كلمة معقدة تتكون من أحرف وأرقام ورموز", "كلمة مخترعة من قبل المستخدم", "كلمة يصعب اختراقها"],
            "correctAnswer": "كلمة مخترعة من قبل المستخدم"
        },
        {
            "Question": "ما هو Shut Down؟",
            "answers": ["إغلاق التطبيق الحالي", "إغلاق نظام التشغيل", "إغلاق الكمبيوتر تمامًا"],
            "correctAnswer": "إغلاق الكمبيوتر تمامًا"
        },
        {
            "Question": "ما هي الملفات؟",
            "answers": ["ملفات تعريف المستخدم", "مساحات لتخزين البيانات والمعلومات", "مجموعات من البيانات والمعلومات"],
            "correctAnswer": "مساحات لتخزين البيانات والمعلومات"
        },
        {
            "Question": "ما هي البرامج؟",
            "answers": ["مجموعة من التطبيقات", "مجموعة من الملفات", "مجموعة توجيهات غير ملموسة"],
            "correctAnswer": "مجموعة توجيهات غير ملموسة"
        },
        {
            "Question": "ما هي المعدات الصلبة؟",
            "answers": ["مكونات الكمبيوتر الخارجية", "مكونات الكمبيوتر الداخلية", "أي قطعة في الكمبيوتر يمكن لمسها ورؤيتها"],
            "correctAnswer": "أي قطعة في الكمبيوتر يمكن لمسها ورؤيتها"
        },
        {
            "Question": "ما هو الفيروس؟",
            "answers": ["برنامج يحذف الملفات أو البيانات", "برنامج يمنع تشغيل البرامج أو الأجهزة الأخرى", "برنامج ضار يصيب البرامج أو الأجهزة الأخرى"],
            "correctAnswer": "برنامج ضار يصيب البرامج أو الأجهزة الأخرى"
        },
        {
            "Question": "ما هي الشبكات؟",
            "answers": ["مجموعة من البرامج المتصلة معًا", "مجموعة من التطبيقات المتصلة معًا", "مجموعة من أجهزة الكمبيوتر المتصلة معًا"],
            "correctAnswer": "مجموعة من أجهزة الكمبيوتر المتصلة معًا"
        },
        {
            "Question": "ما هي الشبكات المحلية؟",
            "answers": ["شبكات عالمية", "شبكات صغيرة نسبيًا", "شبكات كبيرة نسبيًا"],
            "correctAnswer": "شبكات صغيرة نسبيًا"
        },
        {
            "Question": "ما هي الشبكات العالمية؟",
            "answers": ["مجموعة من الشبكات منتشرة في العالم كله", "شبكات صغيرة نسبيًا", "شبكات كبيرة نسبيًا"],
            "correctAnswer": "مجموعة من الشبكات منتشرة في العالم كله"
        },
        {
            "Question": "ما هو المودم؟",
            "answers": ["جهاز يوفر اتصال بالإنترنت", "جهاز يتصل بالإنترنت لاسلكيًا", "جهاز متصل بالإنترنت ويترجم إشارات مزود الخدمة إلى إشارات يمكن للكمبيوتر فهمها"],
            "correctAnswer": "جهاز متصل بالإنترنت ويترجم إشارات مزود الخدمة إلى إشارات يمكن للكمبيوتر فهمها"
        },
        
    ],
    "Flash Cards":  [
            {
                "Question" : "What's The Meaning Of Mind Maps",
                "answers" : ['1','2','3'],
                "correctAnswer" : '1', 
            },
            {
                "Question" : "What 's The Meaning Of Flash Cards",
                "answers" : ['4','5','6'],
                "correctAnswer" : '5', 
            },
            {
                "Question" : "What 's The Meaning Of Flash Maps",
                "answers" : ['1','2','3'],
                "correctAnswer" : '3', 
            },
        ],
    "مفهوم الإقتصاد" : [
        {
            "Question": "ما هو نظام الاقتصاد؟",
            "answers": ['الأنشطة المرتبطة بتصنيع السلع فقط', 'جميع الأنشطة المتعلقة بإنتاج واستهلاك السلع والخدمات', 'العمليات المتعلقة بالتكنولوجيا فقط'],
            "correctAnswer": 'جميع الأنشطة المتعلقة بإنتاج واستهلاك السلع والخدمات'
        },
        {
            "Question": "ما العوامل التي تميز أنواع الاقتصاد؟",
            "answers": ['التنمية الثقافية', 'مستوى التطور والتكنولوجيا والموارد المتاحة', 'اللغة الرسمية'],
            "correctAnswer": 'مستوى التطور والتكنولوجيا والموارد المتاحة'
        },
        {
            "Question": "ما هو دور مستوى التطور في تحديد نوع الاقتصاد؟",
            "answers": ['ليس له أي تأثير', 'يؤثر على نوع الاقتصاد', 'تأثيره يقتصر على الثقافة'],
            "correctAnswer": 'يؤثر على نوع الاقتصاد'
        },
        {
            "Question": "العمليات التي تشمل إنتاج السلع والخدمات تشكل جزءًا من نظام الاقتصاد.",
            "answers": ['صح', 'خطأ'],
            "correctAnswer": 'صح'
        },
        {
            "Question": "التكنولوجيا المستخدمة هي عامل يميز أنواع الاقتصاد.",
            "answers": ['صح', 'خطأ'],
            "correctAnswer": 'صح'
        }
    ],
    "التبادل في الإقتصاد" : [
        {
            "Question": "ما هو التعريف الصحيح للتجارة؟",
            "answers": ["تبادل الأموال بين الأفراد والشركات", "تبادل المنتجات والخدمات بين الأفراد والشركات والدول", "تبادل السلع فقط بين الدول"],
            "correctAnswer": "تبادل المنتجات والخدمات بين الأفراد والشركات والدول"
        },
        {
            "Question": "ما هي إحدى أهميات التجارة؟",
            "answers": ["زيادة الإيرادات الناتجة عن زيادة الإنتاج", "تحفيز الإبتكار والتطوير", "جعل العملات النقدية هي الوسيلة الوحيدة للتبادل"],
            "correctAnswer": "زيادة الإيرادات الناتجة عن زيادة الإنتاج"
        },
        {
            "Question": "ما هي خطوة تطور الاقتصاد التي تشمل تبادل المنتج بمنتج ذو قيمة مماثلة؟",
            "answers": ["الاقتصاد الزراعي", "الاقتصاد التقليدي", "الاقتصاد الصناعي"],
            "correctAnswer": "الاقتصاد التقليدي"
        },
        {
            "Question": "ما هو الاقتصاد الخدمي؟",
            "answers": ["تبادل الخدمات بالذهب", "تبادل الخدمات بالعملات النقدية", "تبادل الخدمات بدون مقابل مالي"],
            "correctAnswer": "تبادل الخدمات بالعملات النقدية"
        },
        {
            "Question": "تقوم التجارة بتلبية الاحتياجات والرغبات.",
            "answers": ["صح", "خطأ"],
            "correctAnswer": "صح"
        },
        {
            "Question": "الاقتصاد التقليدي يتضمن تبادل المنتج بمنتج ذو قيمة مماثلة.",
            "answers": ["صح", "خطأ"],
            "correctAnswer": "صح"
        },
        {
            "Question": "تشجيع التخصص هو أحد أهميات التجارة.",
            "answers": ["صح", "خطأ"],
            "correctAnswer": "صح"
        },
        {
            "Question": "الاقتصاد الخدمي يتضمن تبادل الخدمات بالذهب.",
            "answers": ["صح", "خطأ"],
            "correctAnswer": "خطأ"
        }
    ],
    "المنتجون والمستهلكون": [
        {
            "Question": "ما هو دور المنتجين في النظام الاقتصادي؟",
            "answers": ["القيام بشراء السلع والخدمات", "تصميم المنتجات وإنتاجها وتوفير الخدمات", "تحديد الاتجاهات الاستهلاكية والأذواق"],
            "correctAnswer": "تصميم المنتجات وإنتاجها وتوفير الخدمات"
        },
        {
            "Question": "ما الذي يعمل المنتجون على تحسينه لزيادة الربح؟",
            "answers": ["تحسين جودة المنتجات وخفض التكاليف", "زيادة الإنتاج بدون تغيير", "تقليل الجودة لتوفير التكاليف"],
            "correctAnswer": "تحسين جودة المنتجات وخفض التكاليف"
        },
        {
            "Question": "ماذا يعرف دور المنتجين عند العمل مع الشركات؟",
            "answers": ["دورة الأعمال", "الدورة الاقتصادية", "دورة التسويق"],
            "correctAnswer": "دورة الأعمال"
        },
        {
            "Question": "ما هو دور المستهلكين في النظام الاقتصادي؟",
            "answers": ["تقديم الخدمات", "بيع المنتجات", "شراء الخدمات والمنتجات"],
            "correctAnswer": "شراء الخدمات والمنتجات"
        },
        {
            "Question": "كيف يساهم تصرف المستهلكين في زيادة الانتاج والتوسع في العمل؟",
            "answers": ["بتقليل الطلب على المنتجات", "بالمشاركة في تصميم المنتجات", "بزيادة طلب المنتجات"],
            "correctAnswer": "بزيادة طلب المنتجات"
        },
        {
            "Question": "ما الذي يحددونه المستهلكون في النظام الاقتصادي؟",
            "answers": ["اتجاهات الاستهلاك والأذواق", "تحديد السلع المتاحة في السوق", "تحديد أسعار المنتجات"],
            "correctAnswer": "اتجاهات الاستهلاك والأذواق"
        }
    ]
    ,
    "العرض و اطلب" : [
        {
            "Question": "ما هو تأثير الوقت على العرض والطلب؟",
            "answers": ['الوقت لا يؤثر على العرض والطلب', 'الوقت يزيد العرض والطلب', 'الوقت يقلل العرض والطلب', 'الوقت يؤثر بشكل عشوائي على العرض والطلب'],
            "correctAnswer": 'الوقت يؤثر بشكل عشوائي على العرض والطلب'
        },
        {
            "Question": "العرض يعكس العلاقة العكسية مع السعر وفقًا لقانون العرض والطلب.",
            "answers": ['صح', 'خطأ'],
            "correctAnswer": 'صح'
        },
        {
            "Question": "كيف يمكن أن تؤثر التطور التكنولوجي على العرض؟",
            "answers": ['يزيد من تكلفة المصنع ويقلل العرض', 'يحسن الإنتاج ويزيد العرض', 'لا يؤثر التطور التكنولوجي على العرض', 'يقلل من فعالية الإنتاج ويقلل العرض'],
            "correctAnswer": 'يحسن الإنتاج ويزيد العرض'
        },
        {
            "Question": "التغير في الحالة الاقتصادية لا يؤثر على الطلب.",
            "answers": ['صح', 'خطأ'],
            "correctAnswer": 'خطأ'
        },
        {
            "Question": "الدعاية قد تقلل من السعر المطلوب على المنتجات.",
            "answers": ['صح', 'خطأ'],
            "correctAnswer": 'خطأ'
        },
        {
            "Question": "التغير في الدخل ليس له تأثير على الطلب وفقًا لقانون الطلب.",
            "answers": ['صح', 'خطأ'],
            "correctAnswer": 'خطأ'
        },
        {
            "Question": "العوامل الموسمية يمكن أن تؤثر على قرارات التصنيع والشراء.",
            "answers": ['صح', 'خطأ'],
            "correctAnswer": 'صح'
        },
        {
            "Question": "التغيرات الموسمية تؤثر بشكل أساسي على العرض وليس الطلب.",
            "answers": ['صح', 'خطأ'],
            "correctAnswer": 'خطأ'
        },
        {
            "Question": "ما هو تأثير السعر على قرارات التصنيع والشراء؟",
            "answers": ['ارتفاع الأسعار يزيد الإنتاج ويزيد الشراء', 'انخفاض الأسعار يقلل الإنتاج ويزيد الشراء', 'السعر لا يؤثر على قرارات التصنيع والشراء', 'ارتفاع الأسعار يقلل الإنتاج ويقلل الشراء'],
            "correctAnswer": 'انخفاض الأسعار يقلل الإنتاج ويزيد الشراء'
        },
        {
            "Question": "التطور التكنولوجي يمكن أن يؤثر إيجابًا على تكاليف المصنع.",
            "answers": ['صح', 'خطأ'],
            "correctAnswer": 'صح'
        }
    ],
    "الاحتياجات و الرغباات" : [
        {
            "Question": "ما هو الاختلاف الأساسي بين الاحتياجات والرغبات؟",
            "answers": ['الاحتياجات تكون مادية بينما الرغبات قد تكون عاطفية', 'الاحتياجات هي الطلبات الرئيسية بينما الرغبات هي الطلبات الغير ضرورية', 'الاحتياجات تكون ثابتة بين الأفراد بينما الرغبات تختلف'],
            "correctAnswer": 'الاحتياجات هي الطلبات الرئيسية الضرورية التي يحتاجها الإنسان للحياة، بينما الرغبات هي الطلبات الغير ضرورية وتختلف من شخص لآخر'
        },
        {
            "Question": "من الأمثلة على الاحتياجات؟",
            "answers": ['شراء سيارة جديدة', 'الحصول على تعليم جيد', 'الاستمتاع بالهوايات الترفيهية'],
            "correctAnswer": 'الحصول على تعليم جيد'
        },
        {
            "Question": "هل يمكن أن تكون الرغبات مشتركة بين الأفراد؟",
            "answers": ['نعم، جميع الأفراد يشعرون بنفس الرغبات', 'لا، الرغبات تختلف تمامًا من شخص لآخر', 'تعتمد على السياق والظروف'],
            "correctAnswer": 'تعتمد على السياق والظروف'
        },
        {
            "Question": "هل يمكن للرغبات أن تتغير مع مرور الوقت؟",
            "answers": ['نعم، قد تتغير الرغبات بتطور الظروف والتجارب', 'لا، الرغبات ثابتة طوال الحياة', 'تعتمد على الشخص'],
            "correctAnswer": 'نعم، قد تتغير الرغبات بتطور الظروف والتجارب'
        },
        {
            "Question": "كيف يمكن تحقيق الاحتياجات والرغبات في مجتمع؟",
            "answers": ['عبر تحقيق التوازن بين الاحتياجات والرغبات الفردية', 'بتحديد الاحتياجات وتجاوز الرغبات', 'عن طريق تحديد الرغبات فقط'],
            "correctAnswer": 'عبر تحقيق التوازن بين الاحتياجات والرغبات الفردية'
        }
    ]
    ,
    "مفهوم الندرة في الاقتصاد" :[
        {
            "Question": "الندرة تعني وجود رغبات محدودة في عالم محدود الموارد.",
            "answers": ['صح', 'خطأ'],
            "correctAnswer": 'خطأ'
        },
        {
            "Question": "الاقتصاد يتعامل مع الموارد الغير محدودة والرغبات المحدودة.",
            "answers": ['صح', 'خطأ'],
            "correctAnswer": 'خطأ'
        },
        {
            "Question": "المصادر المحدودة تشمل الموارد البشرية فقط.",
            "answers": ['صح', 'خطأ'],
            "correctAnswer": 'خطأ'
        },
        {
            "Question": "الرغبات الغير محدودة تؤدي إلى زيادة الطلب على الموارد المحدودة.",
            "answers": ['صح', 'خطأ'],
            "correctAnswer": 'صح'
        },
        {
            "Question": "رأس المال يعتبر من الموارد المحدودة في الاقتصاد.",
            "answers": ['صح', 'خطأ'],
            "correctAnswer": 'صح'
        },
        {
            "Question": "ما هو مفهوم الندرة في الاقتصاد؟",
            "answers": ['تواجد الرغبات في عالم محدود الموارد', 'غياب الرغبات في عالم محدود الموارد', 'تواجد الرغبات في عالم غير محدود الموارد'],
            "correctAnswer": 'تواجد الرغبات في عالم محدود الموارد'
        },
        {
            "Question": "ما الذي يتمثل فيه الموارد النادرة في الاقتصاد؟",
            "answers": ['تتمتع بقيمة اقتصادية منخفضة', 'تتمتع بقيمة اقتصادية عالية', 'لا تمتلك قيمة اقتصادية'],
            "correctAnswer": 'تتمتع بقيمة اقتصادية عالية'
        },
        {
            "Question": "من المسؤول عن إدارة الموارد وتجميعها في الاقتصاد؟",
            "answers": ['الأفراد', 'المؤسسات', 'الحكومة'],
            "correctAnswer": 'المؤسسات'
        },
        {
            "Question": "ما الذي يفعل الاقتصاد للتعامل مع الرغبات غير المحدودة والموارد المحدودة؟",
            "answers": ['يزيد من الرغبات', 'يقلل من الطلب', 'يتحكم في التوزيع ويركز على الأولويات'],
            "correctAnswer": 'يتحكم في التوزيع ويركز على الأولويات'
        },
        {
            "Question": "ما الذي تشمله الموارد المحدودة في الاقتصاد؟",
            "answers": ['الموارد الطبيعية فقط', 'الموارد البشرية فقط', 'الموارد الطبيعية والبشرية ورأس المال'],
            "correctAnswer": 'الموارد الطبيعية والبشرية ورأس المال'
        }
    ],
    "تأثير الاختيارات الشرائية للمستهلكين على الاقتصاد" : [
        {
            "Question": "كيف يؤثر انخفاض الطلب على الشركات؟",
            "answers": ['تزيد الربحية', 'تفقد الشركة في الإيرادات', 'تؤدي إلى توسيع الأعمال'],
            "correctAnswer": 'تفقد الشركة في الإيرادات'
        },
        {
            "Question": "ما الذي يحدد حجم الطلب على المنتجات؟",
            "answers": ['الندرة والمصادر المحدودة', 'حجم الاقتصاد', 'الإعلانات التسويقية'],
            "correctAnswer": 'الندرة والمصادر المحدودة'
        },
        {
            "Question": "ما هي العواقب المحتملة لتباطؤ الاقتصاد؟",
            "answers": ['زيادة في الاستثمارات', 'ركود', 'تحسين فرص العمل'],
            "correctAnswer": 'ركود'
        },
        {
            "Question": "كيف يمكن للشركات التكيف مع تغيرات الطلب؟",
            "answers": ['بتقليل إنتاجها', 'بتوسيع أعمالها', 'بزيادة الأسعار'],
            "correctAnswer": 'بتقليل إنتاجها'
        },
        {
            "Question": "كيف يمكن للشركات تحسين فرص العمل؟",
            "answers": ['بتقليل التوظيف', 'بتحسين الأجور', 'بابتكار الأعمال والتوسع'],
            "correctAnswer": 'بابتكار الأعمال والتوسع'
        },
        {
            "Question": "تزيد زيادة الطلب عن المعتاد على المنتجات من نمو الاقتصاد.",
            "answers": ['صح', 'خطأ'],
            "correctAnswer": 'صح'
        },
        {
            "Question": "تأثير انخفاض الطلب يمكن أن يؤدي إلى تباطؤ الاقتصاد.",
            "answers": ['صح', 'خطأ'],
            "correctAnswer": 'صح'
        },
        {
            "Question": "يمكن للشركات التكيف مع تغيرات الطلب عبر زيادة الإنتاج دائمًا.",
            "answers": ['صح', 'خطأ'],
            "correctAnswer": 'خطأ'
        },
        {
            "Question": "الندرة والمصادر المحدودة تؤثر فقط على اتخاذ القرارات الشرائية الفردية.",
            "answers": ['صح', 'خطأ'],
            "correctAnswer": 'خطأ'
        },
        {
            "Question": "تحديد الرغبات التي يمكن تلبيتها يعتمد على الندرة والمصادر المتاحة.",
            "answers": ['صح', 'خطأ'],
            "correctAnswer": 'صح'
        }
    ],
    "اساسيات استخدام النقود" : [
        {
            "Question": "ما هو تأثير زيادة معدل التضخم على القدرة الشرائية؟",
            "answers": ["تقوية القدرة الشرائية", "تقليل القدرة الشرائية", "لا تأثير", "تأثير عشوائي"],
            "correctAnswer": "تقليل القدرة الشرائية"
        }
        ,
        {
            "Question": "هل الدولار الأمريكي هو العملة الاحتياطية الرئيسية في العالم؟",
            "answers": ["نعم", "لا"],
            "correctAnswer": "نعم"
        }
        ,
        {
            "Question": "ما هو تأثير ارتفاع معدل البطالة على الاقتصاد؟",
            "answers": ["تقوية الاقتصاد", "تضعيف الاقتصاد", "لا تأثير", "تأثير عشوائي"],
            "correctAnswer": "تضعيف الاقتصاد"
        }
        ,
        {
            "Question": "هل يمكن للتحسين في معدل التضخم أن يساعد في تعزيز النمو الاقتصادي؟",
            "answers": ["نعم", "لا", "يعتمد على الظروف", "تأثير عشوائي"],
            "correctAnswer": "نعم"
        }
        ,
        {
            "Question": "هل اليورو الأوروبي هو العملة الرئيسية المستخدمة في دول الاتحاد الأوروبي؟",
            "answers": ["نعم", "لا"],
            "correctAnswer": "نعم"
        }
        ,
        {
            "Question": "ما هو الدور الرئيسي للبنوك في النظام المالي؟",
            "answers": ["تصنيع العملات", "تقديم الخدمات المصرفية", "بيع المنتجات", "تقديم الرعاية الصحية"],
            "correctAnswer": "تقديم الخدمات المصرفية"
        }
        ,
        {
            "Question": "هل تؤثر الأحداث السياسية على قيمة العملة الوطنية؟",
            "answers": ["نعم", "لا"],
            "correctAnswer": "نعم"
        }
        ,
        {
            "Question": "هل يمكن للسياسة النقدية التأثير على معدل الفائدة؟",
            "answers": ["نعم", "لا", "تعتمد على السوق", "تأثير عشوائي"],
            "correctAnswer": "نعم"
        }
        ,
        {
            "Question": "هل يمكن لتحسين الإنتاجية أن يساهم في تعزيز النمو الاقتصادي؟",
            "answers": ["نعم", "لا"],
            "correctAnswer": "نعم"
        }
        ,
        {
            "Question": "هل يؤثر انخفاض قيمة العملة على زيادة الصادرات؟",
            "answers": ["نعم", "لا"],
            "correctAnswer": "نعم"
        }
    ],
    "عد النقود" : [
        {
            "Question": "ما هو تأثير عملية العد اليدوي على تسريع العملية؟",
            "answers": ["تسهيل العملية", "تعقيد العملية", "لا تأثير", "تأثير عشوائي"],
            "correctAnswer": "تسهيل العملية"
        }
        ,
        {
            "Question": "هل يعتمد فرز النقود وتقسيمها حسب الفئات على عملية عد يدوية؟",
            "answers": ["نعم", "لا"],
            "correctAnswer": "نعم"
        }
        ,
        {
            "Question": "هل يمكن للآلات الآلية فرز النقود بشكل دقيق وسريع؟",
            "answers": ["نعم", "لا"],
            "correctAnswer": "نعم"
        }
        ,
        {
            "Question": "هل يتم فرز النقود في طريقة Bundling على أساس فئاتها؟",
            "answers": ["نعم", "لا"],
            "correctAnswer": "نعم"
        }
        ,
        {
            "Question": "هل يشمل تجميع النقود بواسطة الآلات فرزها وفقًا للفئات المختلفة؟",
            "answers": ["نعم", "لا"],
            "correctAnswer": "نعم"
        }
        ,
        {
            "Question": "هل يتضمن Coin Roiling تجميع النقود في اسطوانات من الورق المقوى؟",
            "answers": ["نعم", "لا"],
            "correctAnswer": "نعم"
        }
        ,
        {
            "Question": "هل تستخدم استخدام جدول بيانات مثل اكسيل في تطبيقات عد النقود؟",
            "answers": ["نعم", "لا"],
            "correctAnswer": "نعم"
        }
        ,
        {
            "Question": "هل يعتبر تجميع النقود بشكل تلقائي عملية أكثر دقة من العد اليدوي؟",
            "answers": ["نعم", "لا"],
            "correctAnswer": "نعم"
        }
        ,
        {
            "Question": "هل يمكن للاستخدام اليدوي لآلة العد أن يزيد من فعالية عملية فرز النقود؟",
            "answers": ["نعم", "لا"],
            "correctAnswer": "نعم"
        }
        ,
        {
            "Question": "هل يشمل عد النقود يدويًا استخدام جدول بيانات مثل اكسيل؟",
            "answers": ["نعم", "لا"],
            "correctAnswer": "نعم"
        }
        ,
        {
            "Question": "ما هي الطريقة الأكثر فعالية لتسريع عملية عد النقود؟",
            "answers": ["العد اليدوي", "استخدام آلة العد", "فرز النقود يدويًا", "استخدام جهاز حاسبة"],
            "correctAnswer": "استخدام آلة العد"
        }
        ,
        {
            "Question": "ما هي وظيفة طريقة Coin Roiling في عد النقود؟",
            "answers": ["فرز النقود حسب الفئات", "تجميع النقود في اسطوانات", "استخدام الجدول الإلكتروني", "العد اليدوي"],
            "correctAnswer": "تجميع النقود في اسطوانات"
        }
        ,
        {
            "Question": "ما هي الفائدة الرئيسية لتقسيم النقود إلى مجموعات من نفس الفئة في عملية العد اليدوي؟",
            "answers": ["تسريع العملية", "زيادة الدقة", "توفير الوقت", "زيادة الفوضى"],
            "correctAnswer": "توفير الوقت"
        }
        ,
        {
            "Question": "ما هو التحدي الرئيسي الذي يمكن أن يواجه عملية Bundling في عد النقود؟",
            "answers": ["تعقيد الإجراءات", "ضعف الفرز", "زيادة التكلفة", "الخطأ البشري"],
            "correctAnswer": "الخطأ البشري"
        }
        ,
        {
            "Question": "هل يمكن أن يساعد استخدام جدول بيانات مثل اكسيل في تسهيل عملية عد النقود؟",
            "answers": ["نعم", "لا", "يعتمد على الوضع", "تأثير عشوائي"],
            "correctAnswer": "نعم"
        }
        ,
        {
            "Question": "ما هو التأثير الرئيسي لفرز النقود وتقسيمها حسب الفئات على دقة العملية؟",
            "answers": ["تحسين الدقة", "تقليل الفوضى", "زيادة الوقت", "تأثير عشوائي"],
            "correctAnswer": "تحسين الدقة"
        }
        ,
        {
            "Question": "هل يمكن أن يؤدي الاعتماد الكامل على عملية Coin Roiling إلى خطأ في العد؟",
            "answers": ["نعم", "لا", "يعتمد على الظروف", "تأثير عشوائي"],
            "correctAnswer": "نعم"
        }
    ],
    "الناتج القومي" : [
        {
            "Question": "ما هو الناتج القومي؟",
            "answers": ["مؤشر اقتصادي", "سلعة تجارية", "وحدة نقدية", "فائدة مصرفية"],
            "correctAnswer": "مؤشر اقتصادي"
        }
        ,
        {
            "Question": "ما هي وظيفة الناتج القومي؟",
            "answers": ["قياس قدرة الفرد على الانفاق", "تحديد سعر العملات", "قياس قدرة الدولة على الانتاج والانفاق", "تقييم أداء الشركات"],
            "correctAnswer": "قياس قدرة الدولة على الانتاج والانفاق"
        }
        ,
        {
            "Question": "ما هو تأثير ارتفاع الناتج القومي على مستوى المعيشة؟",
            "answers": ["تحسينه", "تدهوره", "لا تأثير", "تأثير عشوائي"],
            "correctAnswer": "تحسينه"
        }
        ,
        {
            "Question": "ما هي المعادلة الصحيحة لحساب الناتج القومي؟",
            "answers": ["الانفاق الاستهلاكي + الانفاق الاتستثماري", "الانفاق الحكومي + صافي الصادرات", "الانفاق الاستهلاكي + الانفاق الحكومي + الانفاق الاتستثماري + صافي الصادرات", "الانفاق الحكومي + الانفاق الاتستثماري"],
            "correctAnswer": "الانفاق الاستهلاكي + الانفاق الحكومي + الانفاق الاتستثماري + صافي الصادرات"
        }
        ,
        {
            "Question": "ما هي العوامل التي تؤثر على الناتج القومي؟",
            "answers": ["الرياح", "التجارة العالمية", "الترفيه", "التاريخ الطبيعي"],
            "correctAnswer": "التجارة العالمية"
        }
        ,
        {
            "Question": "كيف يمكن قياس الناتج القومي للدولة؟",
            "answers": ["بتحليل الأخبار اليومية", "بالنظر إلى مؤشرات الطقس", "بتحليل البيانات الاقتصادية", "بفحص الأحلام"],
            "correctAnswer": "بتحليل البيانات الاقتصادية"
        }
        ,
        {
            "Question": "ما هو تأثير التجارة العالمية على الناتج القومي؟",
            "answers": ["زيادة الواردات تحسن الناتج القومي", "تأثير عشوائي", "تراجع الصادرات يؤدي إلى تدهور الناتج القومي", "التجارة العالمية لا تؤثر على الناتج القومي"],
            "correctAnswer": "تراجع الصادرات يؤدي إلى تدهور الناتج القومي"
        }
        ,
        {
            "Question": "ما هي نسبة الواردات إلى الصادرات التي تشير إلى تأثير سلبي على الناتج القومي؟",
            "answers": ["الواردات > الصادرات", "الواردات < الصادرات", "الواردات = الصادرات", "تأثير عشوائي"],
            "correctAnswer": "الواردات > الصادرات"
        }
        ,
        {
            "Question": "متى يتم حساب الناتج القومي عادةً؟",
            "answers": ["كل عقد", "كل عام", "كل قرن", "تأثير عشوائي"],
            "correctAnswer": "كل عام"
        }
        ,
        {
            "Question": "هل يتأثر الناتج القومي بالإنفاق الحكومي؟",
            "answers": ["نعم", "لا", "يعتمد على الوضع", "تأثير عشوائي"],
            "correctAnswer": "نعم"
        }
    ],
    "الصادرات و الواردات" : [
        {
            "Question": "ما هي الصادرات؟",
            "answers": [
                "المنتجات التي يتم استيرادها من الدول الأخرى.",
                "المنتجات التي تنتج محلياً وتصدر للخارج.",
                "المنتجات التي يتم استهلاكها محلياً دون تصديرها.",
                "المنتجات التي يتم استخدامها في السوق المحلية."
            ],
            "correctAnswer": "المنتجات التي تنتج محلياً وتصدر للخارج."
        }
        ,
        {
            "Question": "ما هي أحد الطرق التي يمكن بها تحسين صادرات الدولة؟",
            "answers": [
                "تقليل جودة المنتجات.",
                "تقليل التنوع في المنتجات.",
                "تحسين جودة المنتجات وزيادة تنوعها.",
                "تقديم بيئة تجارية غير جاذبة."
            ],
            "correctAnswer": "تحسين جودة المنتجات وزيادة تنوعها."
        }
        ,
        {
            "Question": "ما هي الواردات؟",
            "answers": [
                "المنتجات التي يتم تصديرها إلى الدول الأخرى.",
                "المنتجات التي تُنتج محليًا وتباع في السوق المحلية.",
                "المنتجات التي يتم استيرادها من الدول الأخرى.",
                "المنتجات التي لا تحتل مكانة هامة في الاقتصاد الوطني."
            ],
            "correctAnswer": "المنتجات التي يتم استيرادها من الدول الأخرى."
        }
        ,
        {
            "Question": "ما هي الصادرات الرئيسية في مصر؟",
            "answers": [
                "الكهرباء والطاقة البديلة.",
                "الألبان والمنتجات الألبانية.",
                "النفط والغاز الطبيعي.",
                "الكيماويات والأسمدة، المواد البناء والصناعات المعدنية."
            ],
            "correctAnswer": "الكيماويات والأسمدة، المواد البناء والصناعات المعدنية."
        }
        ,
        {
            "Question": "من هم شركاء التجارة الأساسين لمصر؟",
            "answers": [
                "الاتحاد الأفريقي.",
                "دول حوض النيل فقط.",
                "الاتحاد الأوروبي، الولايات المتحدة الأمريكية، الصين، ودول الخليج العربي.",
                "الدول الآسيوية فقط."
            ],
            "correctAnswer": "الاتحاد الأوروبي، الولايات المتحدة الأمريكية، الصين، ودول الخليج العربي."
        }
        ,
        {
            "Question": "ما هي إحدى طرق دفع الواردات؟",
            "answers": [
                "التبادل (Countertrade).",
                "الدفع النقدي فقط.",
                "التسديد المسبق.",
                "التحويل البنكي فقط."
            ],
            "correctAnswer": "التبادل (Countertrade)."
        },
        {
            "Question": "الصادرات تعتبر جزءًا مهمًا من اقتصاد الدولة لأنها تساهم في تحسين النمو الاقتصادي. صح أم خطأ؟",
            "answers": ["صح", "خطأ"],
            "correctAnswer": "صح"
        },
        {
            "Question": "ما العوامل التي يمكن أن تحسن صادرات الدولة؟",
            "answers": ["تقليل تنوع المنتجات", "تقليل جودة المنتجات", "تحسين جودة المنتجات وزيادة تنوعها", "زيادة التكاليف"],
            "correctAnswer": "تحسين جودة المنتجات وزيادة تنوعها"
        },
        {
            "Question": "الواردات تلبي الاحتياجات المحلية وتوفر المواد الخام اللازمة للصناعة. صح أم خطأ؟",
            "answers": ["صح", "خطأ"],
            "correctAnswer": "صح"
        },
        {
            "Question": "ما هي إحدى الصادرات الرئيسية في مصر؟",
            "answers": ["الألبان والمنتجات الألبانية", "الكيماويات والأسمدة، المواد البناء والصناعات المعدنية", "النفط والغاز الطبيعي", "الكهرباء والطاقة البديلة"],
            "correctAnswer": "الكيماويات والأسمدة، المواد البناء والصناعات المعدنية"
        },
        {
            "Question": "أي دولة ليست من شركاء التجارة الأساسيين لمصر؟",
            "answers": ["الولايات المتحدة الأمريكية", "الاتحاد الأوروبي", "روسيا", "البرازيل"],
            "correctAnswer": "البرازيل"
        },
        {
            "Question": "ما هو التحويل البنكي في سياق الواردات؟",
            "answers": ["الدفع النقدي", "الدفع عبر التبادل", "التحويل الإلكتروني عبر البنوك", "الاعتماد المستندي"],
            "correctAnswer": "التحويل الإلكتروني عبر البنوك"
        },
        {
            "Question": "الدول التي تستورد أكثر من تصديرها تعتبر في ركود اقتصادي. صح أم خطأ؟",
            "answers": ["صح", "خطأ"],
            "correctAnswer": "صح"
        },
        {
            "Question": "ما هي وسيلة الدفع التي يتم فيها دفع التكاليف الواردات قبل استلام السلع أو الخدمات؟",
            "answers": ["التحويل البنكي", "الدفع عبر التبادل", "الاعتماد المستندي", "التسديد المسبق"],
            "correctAnswer": "التسديد المسبق"
        }
    ],
    "الإستثمار" : [
        {
            "Question": "ما هو الاستثمار؟",
            "answers": [
                "استخدام المال أو الموارد لشراء أصول مع ربح مستقبلي",
                "التداول في الأسواق المالية فقط",
                "تخزين المال في المصارف بدون ربح مستقبلي",
                "شراء السلع الاستهلاكية للحاجات اليومية"
            ],
            "correctAnswer": "استخدام المال أو الموارد لشراء أصول مع ربح مستقبلي"
        },
        {
            "Question": "ما الفرق بين الاستثمار والادخار؟",
            "answers": [
                "الاستثمار يشمل شراء أصول للحصول على ربح، أما الادخار هو تخزين المال دون شراء أصول",
                "الاستثمار والادخار هما نفس الشيء",
                "الادخار يتضمن شراء أصول فقط",
                "الاستثمار يعني تخزين المال بدون شراء أصول"
            ],
            "correctAnswer": "الاستثمار يشمل شراء أصول للحصول على ربح، أما الادخار هو تخزين المال دون شراء أصول"
        },
        {
            "Question": "ما هي أحد أنواع الاستثمار؟",
            "answers": [
                "العقارات",
                "السياحة",
                "التسوق",
                "الترفيه"
            ],
            "correctAnswer": "العقارات"
        },
        {
            "Question": "ما هي الاستثمارات الرئيسية التي يمكن القيام بها؟",
            "answers": [
                "العقارات، السندات، الأسهم، صناديق الاستثمار",
                "السياحة والتسوق فقط",
                "الملكية الفكرية والفن",
                "الإعلانات ووسائل التواصل الاجتماعي"
            ],
            "correctAnswer": "العقارات، السندات، الأسهم، صناديق الاستثمار"
        },
        {
            "Question": "ما هي ميزة الاستثمار على الادخار؟",
            "answers": [
                "الاستثمار يشمل فقط الخسارة، أما الادخار يضمن الربح",
                "الاستثمار يتضمن فرصة للحصول على ربح مستقبلي أعلى",
                "الادخار يتضمن مخاطر أقل من الاستثمار",
                "الاستثمار والادخار لا فرق بينهما"
            ],
            "correctAnswer": "الاستثمار يتضمن فرصة للحصول على ربح مستقبلي أعلى"
        },
        {
            "Question": "ما هي العوامل التي تحدد نوعية الاستثمارات الخارجية؟",
            "answers": [
                "الناتج القومي فقط",
                "الأوضاع الاقتصادية والسياسية في البلد المستهدف",
                "التقنيات الحديثة فقط",
                "معدلات الفائدة الدولية"
            ],
            "correctAnswer": "الأوضاع الاقتصادية والسياسية في البلد المستهدف"
        }
    ]
}


// Getting All Data Dynamic
const subject = location.pathname.replaceAll('/','').replace('subjects','').replace('index.html','')

fetch(`../../files/${subject}.json`).then(res => res.json()).then(data => {

    // Loop On Data
    data.map(obj => {
        // Change The Units 
        units.push(obj.unitName);

        // Change The Lessons
        lessons[obj.unitName] = obj.Lessons

        // Change The Content
        let contentKeys = Object.keys(obj.content);
        contentKeys.map(key => {
            content[key] = obj.content[key];
        })
    })


const holder = document.querySelector('.boxes');


function createUnitsDivs() {
    // Loop On Units And Craete A Elements For It
    units.forEach(e => {
        // Create Div
        const div = document.createElement('div');
        div.className = 'box';
        // Create H4
        const h4 = document.createElement('h4');
        h4.textContent = e;
        // Append H4 to Div
        div.appendChild(h4);

        // Append Div To The Holder
        holder.appendChild(div);

        // Show Lessons 
        div.addEventListener('click',function() {
            holder.innerHTML = ''
            lessons[e].forEach(lesson => {
                // Create Div
                const div = document.createElement('div');
                div.className = 'box';
                // Create H4
                const h4 = document.createElement('h4');
                h4.textContent = lesson;
                // Append H4 to Div
                div.appendChild(h4);
                // Craete Show Content Button
                const contentBtn = document.createElement('button');
                contentBtn.className = 'content-btn';
                contentBtn.innerHTML = ' المحتوي';
                contentBtn.addEventListener('click',function() {
                    holder.innerHTML = '';
                    showContentof(lesson);
                })
                // Create Show Excersice Button  
                const excersiceBtn = document.createElement('button');
                excersiceBtn.className = 'excercise-btn';
                excersiceBtn.innerHTML = ' الإمتحان';
                excersiceBtn.addEventListener('click',function() {
                    holder.innerHTML = '';
                    showExcersiceOf(lesson);
                })
                // Append Btns To The Div
                div.append(contentBtn);
                div.append(excersiceBtn);
                // Append Div To The Holder
                holder.appendChild(div);
            })
        })
    });
}




// Content Function
function showContentof(lesson) {
    const contentDiv = document.createElement('div');
    contentDiv.className = 'content-step'
    contentDiv.innerHTML = content[lesson];
    holder.appendChild(contentDiv)
}

// Excersice Function
function showExcersiceOf(lesson) {

            // Create Degree List 
            const name = prompt('ما هو اسمك؟');

            // Create Result Div
            const resultDiv = document.createElement('div');
            resultDiv.className = "result";
            
            // Create Title
            const title = document.createElement("H3");
            title.innerText = `درجة امتحانك يا ${name}`;
            resultDiv.appendChild(title);
        
            // Create Span Degree
            const spanDegree = document.createElement('span');
            // spanDegree.innerHTML = `${personDegree} / ${excersices[lesson].length}`;
            resultDiv.appendChild(spanDegree);
        
            // Create Close Button
            const closeBtn = document.createElement('button');
            closeBtn.className = 'close-btn';
            closeBtn.innerHTML = 'Close';
            closeBtn.addEventListener('click',function () {
                resultDiv.remove();
            })
            resultDiv.appendChild(closeBtn);
    
            // Create Degree's List
            const degreeDiv = document.createElement('div');
            degreeDiv.className = 'degree-div';
            resultDiv.appendChild(degreeDiv);

    // If The Lesson Have Excersice
    if (excersices[lesson.trim()] != undefined) {
        // Set The Degree
        let personDegree = 0;

        // Create Excersice Div
        const excersiceDiv = document.createElement('div');
        excersiceDiv.className = 'excersice-step';
        
        // Create Title OF The Step
        const h2 = document.createElement('h2');
        h2.innerHTML =  'امتحان ' + lesson;

        excersiceDiv.appendChild(h2);

        // Loop On All Questions
        excersices[lesson.trim()].forEach((test,testIndex) => {
            
            
            // Create Test Div
            const testDiv = document.createElement('div');
            testDiv.className = 'test';

            // Create Question E
            const h3 = document.createElement('h3');
            h3.innerHTML = test.Question;
            testDiv.appendChild(h3);
            const degreeP = document.createElement('p');
            degreeP.innerHTML = `${test.Question} <span>=></span> ${test.correctAnswer}`;
            degreeP.className = 'false';
            degreeDiv.appendChild(degreeP);

            // Create Answers Div
            const answersDiv = document.createElement('div');
            answersDiv.className = 'answersDiv';
            // Loop On Each Answer And Add Radio Buttons
            test.answers.forEach(answer => {

                const answerDiv = document.createElement('div');


                const answerInput = document.createElement('input');
                answerInput.value = answer;
                answerInput.id = answer + testIndex;
                answerInput.type = 'radio';
                answerInput.name = 'answer-' + testIndex;

                answerInput.addEventListener('input',()=> {
                    let correctAnswer = test.correctAnswer
                    if (answerInput.value == correctAnswer) {
                            personDegree++
                            degreeP.classList.remove('false');
                            degreeP.classList.toggle('true');
                    } else {
                        if (personDegree != 0) {
                            personDegree--
                            degreeP.classList.add('false');
                        }
                    }
                })


                // Create Label
                const label = document.createElement('label');
                label.innerHTML = answer;
                label.setAttribute('for',answer + testIndex);

                answerDiv.appendChild(answerInput);
                answerDiv.appendChild(label);

                answersDiv.appendChild(answerDiv);
            })

            // Append Answers Div To The Test Div
            testDiv.appendChild(answersDiv);


            // Append Test Div TO Excersice Div
            excersiceDiv.appendChild(testDiv);
        })


        // Create Check Button
        const checkButton = document.createElement('button');
        checkButton.innerHTML = 'Check';
        checkButton.className = 'check-btn'
        checkButton.addEventListener('click',function() {
            // Show Result Div
            // spanDegree.innerHTML = `${personDegree} / ${excersices[lesson].length}`;
            document.body.appendChild(resultDiv);
        })
        excersiceDiv.appendChild(checkButton);

        holder.appendChild(excersiceDiv);

        

        







    } else {
        const p = document.createElement('p');
        p.innerHTML = `This Lesson "${lesson}" <br> Don't Have Excersice`;
        holder.appendChild(p);
    }
}



    createUnitsDivs();


})

